mati5kova/stm32-ultrasonic-radar/Core/Src/display.c
#include "display.h"
#include "adc.h"
#include "buzzer.h"
#include "fonts.h"
#include "hcsr04.h"
#include "helper_functions.h"
#include "joystick.h"
#include "main.h"
#include "stm32_lcd.h"
#include "stm32h750b_discovery_errno.h"
#include "stm32h750b_discovery_lcd.h"
#include "stm32h750b_discovery_sdram.h"
#include "stm32h750b_discovery_ts.h"
#include "stm32h7xx_hal.h"
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

volatile uint8_t refresh_frame_flag = 0;

extern volatile uint16_t* internal_temperature_sensor_reading;

#define F_PI 3.14159265358979323846f

/*kotna hitrost sweeperja*/
#define SWEEPER_ANGULAR_VELOCITY 0.785f
/*50ms max da preprecimo prevelike skoke*/
#define FRAME_TIME_LIMIT 0.05f
/* popravek za floating point aritmetiko ce ne pridemo na tocno 2*F_PI (0->180) oziroma F_PI (180->0)
 * clampamo na vrednost in se #e vedno obrnemo v drugo smer
 */
#define ANGLE_EPSILON 0.001f
#define SWEEPER_HANDLE_THICKNESS_HALF 0.04f

#define LCD_HALF_WIDTH (LCD_DEFAULT_WIDTH / 2)
#define BACKGROUND_COLOR 0xFF202613UL

/*crte na ozadju, diagonalne crte*/
#define NBR_OF_VERTICAL_LINES 9
#define NBR_OF_HORIZONTAL_LINES 10
#define NBR_OF_DIAGONAL_LINES_INNER 7
#define NBR_OF_DIAGONAL_LINES_OUTER 40
#define BACKGROUND_LINES_COLOR 0xFF2D4719UL
#define BACKGROUND_DIAGONAL_LINES_COLOR 0xFF909C11UL

/*vse kar se zadeva vogalov*/
#define NBR_OF_CORNERS 4
#define CORNER_ARM_LENGTH 35
#define CORNER_ARM_WIDTH 4
#define CORNER_OFFSET_X 15
#define CORNER_OFFSET_Y 15
#define CORNER_COLOR LCD_COLOR_ARGB8888_ST_GREEN_LIGHT

#define OUTER_HALF_CIRCLE_RADIUS 200
#define INNER_FULL_CIRCLE_RADIUS 18
#define MAIN_SWEEPER_BOTTOM_OFFSET 45
#define OUTER_HALF_CIRCLE_COLOR LCD_COLOR_ARGB8888_ST_GREEN_LIGHT

/*vse kar se zadeva pozicij texta na spodnjem delu displaya*/
// izpis temperaturnega senzorja
#define INTERNAL_TEMP_TEXT_X (0 + CORNER_OFFSET_X + 7)
#define INTERNAL_TEMP_TEXT_Y (LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y - 13)
#define INTERNAL_TEMP_TEXT_WIDTH 80
// izpis distance
#define DISTANCE_TEXT_Y (LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET + INNER_FULL_CIRCLE_RADIUS + 10)
#define DISTANCE_TEXT_WIDTH 100
// izpise smeri joysticka
#define JOYSTICK_TEXT_Y (LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y - 13)
#define JOYSTICK_TEXT_X_MAX (LCD_DEFAULT_WIDTH - CORNER_OFFSET_X - 4)
#define JOYSTICK_TEXT_WIDTH 90

// default kordinate za ikono zvocnika levo zgoraj
#define VOLUME_ICON_BASE_X (CORNER_OFFSET_X + CORNER_ARM_WIDTH + 1)
#define VOLUME_ICON_BASE_Y (CORNER_OFFSET_Y + CORNER_ARM_WIDTH)
#define VOLUME_ICON_COLOR LCD_COLOR_ARGB8888_WHITE

/*radar dots*/
#define MAX_DISTANCE_TO_RENDER_DOT 400 //[cm]
#define MIN_DISTANCE_TO_RENDER_DOT 10  //[cm]
#define NBR_OF_RADAR_DOTS 150
#define RADAR_DOT_LIFE_SPAN 6000 // [ms]

static uint32_t last_tick = 0;
float_t sweeper_handle_angle = F_PI + SWEEPER_HANDLE_THICKNESS_HALF;
static uint8_t sweeper_direction = 1; // 1 = smer urinega kazalca (0->180), 0 = obratna smer urinega kazalca (180->0)

/*uporabi se za ucinkovito clearanje samo potrebnih delov ekrana*/
static Point last_sweeper_points[4] = {0};
static uint8_t first_frame = 1;

TS_State_t ts_state;

static inline void set_dot_data_zero(void);

static inline void internal_draw_corner(void);
static void internal_draw_half_circle(uint16_t x_center, uint16_t y_center, uint16_t radius, uint32_t color);
static inline uint16_t internal_center_text_x_cordinate(uint8_t* str, sFONT font);
static void internal_draw_diagonal_lines(uint16_t x_center, uint16_t y_center, uint16_t outer_radius,
                                         uint16_t inner_radius);

static inline void internal_clear_sweep_area(void);
static inline void internal_dynamic_layer_draw_volume_icon(void);
static inline void internal_dynamic_layer_draw_temp_sens(void);
static inline void internal_dynamic_layer_draw_distance(void);
static inline void internal_dynamic_layer_draw_joystick_aim_dir(void);
static void internal_dynamic_layer_draw_sweeper_line(float_t angle, uint16_t x_center, uint16_t y_center,
                                                     uint16_t outer_radius, uint16_t inner_radius);
static void internal_dynamic_layer_draw_radar_dots(void);

typedef struct
{
    uint8_t valid;
    uint16_t distance;
    float_t angle;
    uint32_t timestamp;

} RadarDot_TypeDef;

__attribute__((aligned(32))) volatile RadarDot_TypeDef radar_dots[NBR_OF_RADAR_DOTS];
uint16_t radar_dots_next_index = 0;

static Point corner_cordinates[4][2] = {
    /*levo zgoraj*/
    {
        {0 + CORNER_OFFSET_X, 0 + CORNER_OFFSET_Y},
        {0 + CORNER_OFFSET_X, 0 + CORNER_OFFSET_Y},
    },
    /*levo spodaj*/
    {{0 + CORNER_OFFSET_X, LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y},
     {0 + CORNER_OFFSET_X, LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y - CORNER_ARM_LENGTH}},
    /*desno zgoraj*/
    {{LCD_DEFAULT_WIDTH - CORNER_OFFSET_X - CORNER_ARM_LENGTH, 0 + CORNER_OFFSET_Y},
     {LCD_DEFAULT_WIDTH - CORNER_OFFSET_X, 0 + CORNER_OFFSET_Y}},
    /*desno spodaj*/
    {{LCD_DEFAULT_WIDTH - CORNER_OFFSET_X - CORNER_ARM_LENGTH, LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y},
     {LCD_DEFAULT_WIDTH - CORNER_OFFSET_X, LCD_DEFAULT_HEIGHT - CORNER_OFFSET_Y - CORNER_ARM_LENGTH}}};

// oblika zvocnika, original narisan na papir
static Point speaker_outline_points[6] = {
    {VOLUME_ICON_BASE_X + 4, VOLUME_ICON_BASE_Y + 11},  //
    {VOLUME_ICON_BASE_X + 10, VOLUME_ICON_BASE_Y + 11}, //
    {VOLUME_ICON_BASE_X + 16, VOLUME_ICON_BASE_Y + 7},  //
    {VOLUME_ICON_BASE_X + 16, VOLUME_ICON_BASE_Y + 23}, //
    {VOLUME_ICON_BASE_X + 10, VOLUME_ICON_BASE_Y + 19}, //
    {VOLUME_ICON_BASE_X + 4, VOLUME_ICON_BASE_Y + 19},  //

};

volatile uint8_t prev_buzzer_mode_active = 0;

static inline void set_dot_data_zero(void)
{
    memset((void*)radar_dots, 0, sizeof(RadarDot_TypeDef) * NBR_OF_RADAR_DOTS);
}

void MK_Display_Init(void)
{
    if (BSP_SDRAM_Init(0) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    if (BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE) != BSP_ERROR_NONE)
    {
        Error_Handler();
    } // BSP_LCD_Init konfigurira layer 0 po defaultu

    BSP_LCD_LayerConfig_t layer1_config;
    layer1_config.X0 = 0;
    layer1_config.X1 = LCD_DEFAULT_WIDTH;
    layer1_config.Y0 = 0;
    layer1_config.Y1 = LCD_DEFAULT_HEIGHT;
    layer1_config.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
    layer1_config.Address = LCD_LAYER_1_ADDRESS;

    if (BSP_LCD_ConfigLayer(0, DYNAMIC_LAYER, &layer1_config) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

