mati5kova/stm32-ultrasonic-radar/Core/Src/display.c
    // naredimo oba layerja vidna
    if (BSP_LCD_SetLayerVisible(0, BACKGROUND_LAYER, ENABLE) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }
    if (BSP_LCD_SetLayerVisible(0, DYNAMIC_LAYER, ENABLE) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    // transparency = 255 -> NE vidno skozi
    if (BSP_LCD_SetTransparency(0, BACKGROUND_LAYER, 255) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }
    if (BSP_LCD_SetTransparency(0, DYNAMIC_LAYER, 255) != BSP_ERROR_NONE)
    {
        Error_Handler();
    } // layer pixli kontrolirajo svoj alpha

    if (BSP_LCD_SetActiveLayer(0, BACKGROUND_LAYER) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    UTIL_LCD_SetFuncDriver(&LCD_Driver);

    // touchsreen init
    TS_Init_t ts_init = {0};
    ts_init.Height = LCD_DEFAULT_HEIGHT;
    ts_init.Width = LCD_DEFAULT_WIDTH;
    ts_init.Orientation = LCD_ORIENTATION_LANDSCAPE;
    ts_init.Accuracy = 5;
    if (BSP_TS_Init(0, &ts_init) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    if (BSP_TS_EnableIT(0) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    // prizgemo display
    if (BSP_LCD_DisplayOn(0) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    // 0(zero) set za vse tocke na radarju - enkratni dogodek
    set_dot_data_zero();
}

void wait_for_vsync(void)
{
    /*pocakamo na VSYNC za preprecimo tearing*/
    /*mogoce implementiraj se pravi double buffering - mogoce se splaca*/

    // CDSR - current display status register
    // ce je current display v fazi vertical synchronization je VSYNCS bit postavljen na 1
    while (!(LTDC->CDSR & LTDC_CDSR_VSYNCS)) {} // pocakaj da se VSYNC zacne
    while ((LTDC->CDSR & LTDC_CDSR_VSYNCS)) {}  // pocakaj da se VSYNC zakljuci
}

void draw_background_static_once(void)
{
    if (BSP_LCD_SetActiveLayer(0, DYNAMIC_LAYER) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }
    UTIL_LCD_Clear(0x00000000UL);

    if (BSP_LCD_SetActiveLayer(0, BACKGROUND_LAYER) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }
    UTIL_LCD_Clear(BACKGROUND_COLOR);

    /*vertikalne crte ozadja*/
    for (uint8_t i = 1; i < NBR_OF_VERTICAL_LINES; i++)
    {
        UTIL_LCD_DrawVLine((uint32_t)(i * LCD_DEFAULT_WIDTH / NBR_OF_VERTICAL_LINES), 0, LCD_DEFAULT_HEIGHT,
                           BACKGROUND_LINES_COLOR);
    }

    /*horizontalne crte ozadja*/
    for (uint8_t i = 1; i < NBR_OF_HORIZONTAL_LINES; i++)
    {
        UTIL_LCD_DrawHLine(0, (uint32_t)(i * LCD_DEFAULT_HEIGHT / NBR_OF_HORIZONTAL_LINES), LCD_DEFAULT_WIDTH,
                           BACKGROUND_LINES_COLOR);
    }

    /*veliki polkrog po katerem hodi sweeper*/
    internal_draw_half_circle(LCD_HALF_WIDTH, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET, OUTER_HALF_CIRCLE_RADIUS,
                              OUTER_HALF_CIRCLE_COLOR);

    /*manjsi polkrog znotraj velikega polkroga*/
    internal_draw_half_circle(LCD_HALF_WIDTH, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET, 40,
                              BACKGROUND_DIAGONAL_LINES_COLOR);

    /*najmanjsi polkrog znotraj velikega polkroga*/
    internal_draw_half_circle(LCD_HALF_WIDTH, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET, 80,
                              BACKGROUND_DIAGONAL_LINES_COLOR);

    /*mali krog na dnu (izhodisce za sweeper handle)*/
    UTIL_LCD_DrawCircle(LCD_HALF_WIDTH, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET, INNER_FULL_CIRCLE_RADIUS,
                        LCD_COLOR_ARGB8888_ST_GREEN_LIGHT);

    /*crta v desno od majhnega kroga na dnu*/
    UTIL_LCD_DrawRect(LCD_HALF_WIDTH + INNER_FULL_CIRCLE_RADIUS, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET,
                      OUTER_HALF_CIRCLE_RADIUS - INNER_FULL_CIRCLE_RADIUS, 1, LCD_COLOR_ARGB8888_ST_GREEN_LIGHT);

    /*crta v levo od majhnega kroga na dnu*/
    UTIL_LCD_DrawRect(LCD_HALF_WIDTH - OUTER_HALF_CIRCLE_RADIUS, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET,
                      OUTER_HALF_CIRCLE_RADIUS - INNER_FULL_CIRCLE_RADIUS, 1, LCD_COLOR_ARGB8888_ST_GREEN_LIGHT);

    /*vsi robovi ekrana (4x)*/
    internal_draw_corner();

    /*NBR_OF_DIAGONAL_LINES_INNER diagonalnih crt od roba malega notranjega kroga do tock na zunanjem polkrogu*/
    /* + NBR_OF_DIAGONAL_LINES_OUTER majhnih diagonalnih crt od roba velike kroznice navzven*/
    internal_draw_diagonal_lines(LCD_HALF_WIDTH, LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET,
                                 OUTER_HALF_CIRCLE_RADIUS, INNER_FULL_CIRCLE_RADIUS);
}

/*pocisti sweeper handle + text boxe namesto UTIL_LCD_Clear - bolj performant*/
static inline void internal_clear_sweep_area(void)
{
    if (BSP_LCD_SetActiveLayer(0, DYNAMIC_LAYER) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    if (!first_frame)
    {
        // pocisti zadnjo sweeper crto
        UTIL_LCD_FillPolygon(last_sweeper_points, 4, 0x00000000UL);
    }

    // text boxi se clearajo v posameznih funkcijah za tisti text
}

/*render vseh dinamicnih elementov*/
void draw_dynamic_content(void)
{
    uint32_t now = HAL_GetTick();
    /* izracunamo casovno razliko (delta time) (v sekundah) od zadnjega frame-a
     *  brez tega ne upostevamo frame rate-a in bi se sweeper premikal razlicno glede na fps (nastavljen v initu za
     *  TIM7)
     */
    float_t dt = (now - last_tick) * 0.001f;
    last_tick = now;

    /* omejimo vrednost dt, ce se npr. zaradi printf ali neke druge blocking stvari zatakne za dlje casa ne bomo
     * izgubili sweepanja za minili cas
     */
    if (dt > FRAME_TIME_LIMIT || dt <= 0.0f)
    {
        dt = FRAME_TIME_LIMIT;
    }

    if (BSP_LCD_SetActiveLayer(0, DYNAMIC_LAYER) != BSP_ERROR_NONE)
    {
        Error_Handler();
    }

    /*pocisti obmocje sweeperja*/
    internal_clear_sweep_area();

    // buzzer mode
    internal_dynamic_layer_draw_volume_icon();
    /*razdalja ki jo trenutno meri HC-SR04*/
    internal_dynamic_layer_draw_distance();
    /*trenutna temperatura internega temperaturnega senzorja*/
    internal_dynamic_layer_draw_temp_sens();
    /*trenutna smer joysticka*/
    internal_dynamic_layer_draw_joystick_aim_dir();

