mati5kova/stm32-ultrasonic-radar/Core/Src/display.c
    /*sweeper handle na trenutnem kotu (offsetu od base-a)*/
    internal_dynamic_layer_draw_sweeper_line(sweeper_handle_angle, LCD_HALF_WIDTH,
                                             LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET, OUTER_HALF_CIRCLE_RADIUS,
                                             INNER_FULL_CIRCLE_RADIUS);

    internal_dynamic_layer_draw_radar_dots();

    // izracun novega kota - odvisen od dt
    float_t angle_delta = SWEEPER_ANGULAR_VELOCITY * dt;

    if (sweeper_direction) // 0->180
    {
        sweeper_handle_angle += angle_delta;
        /*SWEEPER_HANDLE_THICKNESS_HALF je offset zaradi debeline sweeper handle-a, prepreci da gre handle cez spodnjo
         * mejo (crto) sweeper ekrana
         */
        if (sweeper_handle_angle >= (2 * F_PI - ANGLE_EPSILON - SWEEPER_HANDLE_THICKNESS_HALF))
        {
            sweeper_handle_angle = 2 * F_PI - SWEEPER_HANDLE_THICKNESS_HALF;
            sweeper_direction = 0;
        }
    }
    else // 180->0
    {
        sweeper_handle_angle -= angle_delta;
        /*-||-*/
        if (sweeper_handle_angle <= (F_PI + ANGLE_EPSILON + SWEEPER_HANDLE_THICKNESS_HALF))
        {
            sweeper_handle_angle = F_PI + SWEEPER_HANDLE_THICKNESS_HALF;
            sweeper_direction = 1;
        }
    }
}

static inline void internal_draw_corner(void)
{
    /* za vsak entry v corner_cordinates izrise kotni (corner) element
     * ∀i: corner_cordinates[i][0] - X in Y kordinati za zacetek risanja polovice celote roba v desno
     *     corner_cordinates[i][1] - X in Y kordinati za zacetek risanja polovice celote roba navzdol
     */
    for (uint8_t i = 0; i < NBR_OF_CORNERS; i++)
    {
        UTIL_LCD_FillRect(corner_cordinates[i][0].X, corner_cordinates[i][0].Y,
                          CORNER_ARM_LENGTH + (i == 0 || i == 1 ? 3 : 0), CORNER_ARM_WIDTH,
                          CORNER_COLOR); // rise crto v desno
        UTIL_LCD_FillRect(corner_cordinates[i][1].X, corner_cordinates[i][1].Y, CORNER_ARM_WIDTH,
                          CORNER_ARM_LENGTH + (i == NBR_OF_CORNERS - 1 ? 4 : 0),
                          CORNER_COLOR); // rise crto navzdol
    }
}

static void internal_draw_half_circle(uint16_t x_center, uint16_t y_center, uint16_t radius, uint32_t color)
{
    float_t start_angle = F_PI, end_angle = 2 * F_PI;

    // povecaj/zmanjsaj angle_step za vecjo/manjso natancnost
    for (float_t angle = start_angle; angle <= end_angle; angle += 0.0005f)
    {
        uint16_t x = x_center + (int16_t)(radius * cosf(angle));
        uint16_t y = y_center + (int16_t)(radius * sinf(angle));
        UTIL_LCD_SetPixel(x, y, color);
    }
}

/*uporabi za izracun x kordinate za centriran text na displayu*/
static inline uint16_t internal_center_text_x_cordinate(uint8_t* str, sFONT font)
{
    return (LCD_HALF_WIDTH - (strlen((const char*)str) * font.Width / 2));
}

static void internal_draw_diagonal_lines(uint16_t x_center, uint16_t y_center, uint16_t outer_radius,
                                         uint16_t inner_radius)
{
    // large_slice je razmik med diagonalnimi crtami znotraj polkroga
    float_t large_slice = F_PI / (NBR_OF_DIAGONAL_LINES_INNER + 1);
    // small_slice je razmik med kratkimi diagonalnimi crtami zunaj polkroga
    float_t small_slice = F_PI / (NBR_OF_DIAGONAL_LINES_OUTER);

    for (uint8_t i = 1; i <= NBR_OF_DIAGONAL_LINES_INNER; i++)
    {
        uint16_t x_outer = x_center + (int16_t)(outer_radius * cosf(F_PI + i * large_slice));
        uint16_t y_outer = y_center + (int16_t)(outer_radius * sinf(F_PI + i * large_slice));

        uint16_t x_inner = x_center + (int16_t)(inner_radius * cosf(F_PI + i * large_slice));
        uint16_t y_inner = y_center + (int16_t)(inner_radius * sinf(F_PI + i * large_slice));

        UTIL_LCD_DrawLine(x_inner, y_inner, x_outer, y_outer, BACKGROUND_DIAGONAL_LINES_COLOR);
    }

    for (uint8_t i = 0; i <= NBR_OF_DIAGONAL_LINES_OUTER; i++)
    {
        // crte na indexih deljivih s 5 lezijo na large_slice diagonalah in so malo vecje
        uint8_t extension = (i % 5) == 0 ? 4 : 0;

        uint16_t x_outer = x_center + (int16_t)((outer_radius + 9 + extension) * cosf(F_PI + i * small_slice));
        uint16_t y_outer = y_center + (int16_t)((outer_radius + 9 + extension) * sinf(F_PI + i * small_slice));

        uint16_t x_inner = x_center + (int16_t)((outer_radius + 6 - extension * 0.75f) * cosf(F_PI + i * small_slice));
        uint16_t y_inner = y_center + (int16_t)((outer_radius + 6 - extension * 0.75f) * sinf(F_PI + i * small_slice));

        UTIL_LCD_DrawLine(x_inner, y_inner, x_outer, y_outer, BACKGROUND_DIAGONAL_LINES_COLOR);
    }
}

static inline void internal_dynamic_layer_draw_volume_icon(void)
{
    /* first_frame se nastavi na 0 v `internal_dynamic_layer_draw_sweeper_line` ni potrebno tukaj (mogoce bi bilo bolje
     * zaradi doslednosti)
     *
     * early return je tukaja da ne re-renderamo celotne volume ikone vsak frame
     */
    if (buzzer_mode_active == prev_buzzer_mode_active && !first_frame)
    {
        return;
    }
    prev_buzzer_mode_active = buzzer_mode_active;

    UTIL_LCD_FillRect(VOLUME_ICON_BASE_X, VOLUME_ICON_BASE_Y, 35, 35, 0x00000000UL);

    UTIL_LCD_FillPolygon(speaker_outline_points, 6, VOLUME_ICON_COLOR);

    if (buzzer_mode_active)
    {
        uint16_t sound_bar_x = VOLUME_ICON_BASE_X + 16;
        uint16_t sound_bar_y = VOLUME_ICON_BASE_Y + 15;
        float_t arch = 0.7f;

        // lepe oddaljenosti od zacetka so 5, 8.5 in 12 (+3.5)
        // -0.7 do +0.7 ustvari lep lok

        for (float a = -arch; a <= arch; a += 0.08f)
        {
            UTIL_LCD_SetPixel(sound_bar_x + (5.0f * cosf(a)), sound_bar_y + (5.0f * sinf(a)), VOLUME_ICON_COLOR);
            UTIL_LCD_SetPixel(sound_bar_x + (5.0f * cosf(a)) + 1, sound_bar_y + (5.0f * sinf(a)), VOLUME_ICON_COLOR);
        }

        for (float a = -arch; a <= arch; a += 0.08f)
        {
            UTIL_LCD_SetPixel(sound_bar_x + (8.5f * cosf(a)), sound_bar_y + (8.5f * sinf(a)), VOLUME_ICON_COLOR);
            UTIL_LCD_SetPixel(sound_bar_x + (8.5f * cosf(a)) + 1, sound_bar_y + (8.5f * sinf(a)), VOLUME_ICON_COLOR);
        }

        for (float a = -arch; a <= arch; a += 0.08f)
        {
            UTIL_LCD_SetPixel(sound_bar_x + (12.0f * cosf(a)), sound_bar_y + (12.0f * sinf(a)), VOLUME_ICON_COLOR);
            UTIL_LCD_SetPixel(sound_bar_x + (12.0f * cosf(a)) + 1, sound_bar_y + (12.0f * sinf(a)), VOLUME_ICON_COLOR);
        }
    }
    else
    {
        // sredisce kri#a
        uint16_t cross_x = VOLUME_ICON_BASE_X + 24;
        uint16_t cross_y = VOLUME_ICON_BASE_Y + 15;
        // rob vsake nogice je za toliko enot odmaknjen od sredisca
        uint8_t cross_size = 5;

        // ponovimo dvakrat da je bolj debelo, i predstavlja offset
        for (int8_t i = 0; i <= 1; i++)
        {
            // levo gor do desno dol - odebeljeno v x smer (+i)
            UTIL_LCD_DrawLine(cross_x - cross_size + i, cross_y - cross_size, cross_x + cross_size + i,
                              cross_y + cross_size, VOLUME_ICON_COLOR);
            // levo gor do desno dol - odebeljeno v y smer
            UTIL_LCD_DrawLine(cross_x - cross_size, cross_y - cross_size + i, cross_x + cross_size,
                              cross_y + cross_size + i, VOLUME_ICON_COLOR);
            // desno gor do levo dol - odebeljeno v x smer (-i)
            UTIL_LCD_DrawLine(cross_x + cross_size - i, cross_y - cross_size, cross_x - cross_size - i,
                              cross_y + cross_size, VOLUME_ICON_COLOR);
            // desno gor do levo dol - odebeljeno v y smer
            UTIL_LCD_DrawLine(cross_x + cross_size, cross_y - cross_size + i, cross_x - cross_size,
                              cross_y + cross_size + i, VOLUME_ICON_COLOR);
        }
    }
}

static inline void internal_dynamic_layer_draw_temp_sens(void)
{
    static uint8_t str[9];
    snprintf((char*)str, 9, "%2.2f$C", (double_t)calc_intern_temp_sens(*internal_temperature_sensor_reading));
    str[8] = '\0';

    // pocistimo obmocje kjer je prej lezal text
    UTIL_LCD_FillRect(INTERNAL_TEMP_TEXT_X, INTERNAL_TEMP_TEXT_Y, INTERNAL_TEMP_TEXT_WIDTH, Font12.Height,
                      0x00000000UL);

    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetBackColor(0x00000000UL);
    UTIL_LCD_SetTextColor(LCD_COLOR_ARGB8888_WHITE);
    UTIL_LCD_DisplayStringAt(INTERNAL_TEMP_TEXT_X, INTERNAL_TEMP_TEXT_Y, str, LEFT_MODE);
}

static inline void internal_dynamic_layer_draw_distance(void)
{
    float_t read_distance;
    if (!HCSR04_ReadDistance(&read_distance))
    {
        return;
    }

