mati5kova/stm32-ultrasonic-radar/Core/Src/display.c
    uint8_t str[9];
    snprintf((char*)str, 9, "%3.2fcm", (double_t)read_distance);
    str[8] = '\0';

    // pocistimo obmocje kjer je prej lezal text
    UTIL_LCD_FillRect(LCD_HALF_WIDTH - (DISTANCE_TEXT_WIDTH / 2), DISTANCE_TEXT_Y, DISTANCE_TEXT_WIDTH, Font12.Height,
                      0x00000000UL);

    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetBackColor(0x00000000UL);
    UTIL_LCD_SetTextColor(LCD_COLOR_ARGB8888_WHITE);
    UTIL_LCD_DisplayStringAt(internal_center_text_x_cordinate((uint8_t*)str, Font12), DISTANCE_TEXT_Y, (uint8_t*)str,
                             LEFT_MODE);
}

static inline void internal_dynamic_layer_draw_joystick_aim_dir(void)
{
    uint8_t* str = get_str_from_aim_dir();

    // pocistimo obmocje kjer je prej lezal text
    UTIL_LCD_FillRect(JOYSTICK_TEXT_X_MAX - JOYSTICK_TEXT_WIDTH, JOYSTICK_TEXT_Y, JOYSTICK_TEXT_WIDTH, Font12.Height,
                      0x00000000UL);

    UTIL_LCD_SetFont(&Font12);
    UTIL_LCD_SetBackColor(0x00000000UL);
    UTIL_LCD_SetTextColor(LCD_COLOR_ARGB8888_WHITE);
    UTIL_LCD_DisplayStringAt(JOYSTICK_TEXT_X_MAX - strlen((char*)str) * Font12.Width, JOYSTICK_TEXT_Y, str, LEFT_MODE);
}

static void internal_dynamic_layer_draw_sweeper_line(float_t angle, uint16_t x_center, uint16_t y_center,
                                                     uint16_t outer_radius, uint16_t inner_radius)
{
    // odmik kota levo od sweeper handle-a
    float_t angle_left = angle - SWEEPER_HANDLE_THICKNESS_HALF;
    // odmik kota desno od sweeper handle-a
    float_t angle_right = angle + SWEEPER_HANDLE_THICKNESS_HALF;

    float_t cos_left = cosf(angle_left);
    float_t sin_left = sinf(angle_left);
    float_t cos_right = cosf(angle_right);
    float_t sin_right = sinf(angle_right);

    Point points[4];

    // znotraj levo
    points[0].X = x_center + (int16_t)(inner_radius * cos_left);
    points[0].Y = y_center + (int16_t)(inner_radius * sin_left);

    // zunaj levo
    points[1].X = x_center + (int16_t)(outer_radius * cos_left);
    points[1].Y = y_center + (int16_t)(outer_radius * sin_left);

    // zunaj desno
    points[2].X = x_center + (int16_t)(outer_radius * cos_right);
    points[2].Y = y_center + (int16_t)(outer_radius * sin_right);

    // znotraj desno
    points[3].X = x_center + (int16_t)(inner_radius * cos_right);
    points[3].Y = y_center + (int16_t)(inner_radius * sin_right);

    UTIL_LCD_FillPolygon(points, 4, BACKGROUND_DIAGONAL_LINES_COLOR);

    // Shrani za naslednji clear
    memcpy(last_sweeper_points, points, sizeof(points));
    first_frame = 0;
}

static void internal_dynamic_layer_draw_radar_dots(void)
{
    uint32_t now = HAL_GetTick();

    for (uint16_t i = 0; i < NBR_OF_RADAR_DOTS; i++)
    {
        if (!radar_dots[i].valid)
        {
            continue;
        }

        // fade out cez RADAR_DOT_LIFE_SPAN sekund

        uint32_t age = now - radar_dots[i].timestamp;

        float_t scaled_distance =
            (radar_dots[i].distance / (float_t)MAX_DISTANCE_TO_RENDER_DOT) * OUTER_HALF_CIRCLE_RADIUS;

        int16_t x = LCD_HALF_WIDTH + (int16_t)(scaled_distance * cosf(radar_dots[i].angle));
        int16_t y =
            LCD_DEFAULT_HEIGHT - MAIN_SWEEPER_BOTTOM_OFFSET + (int16_t)(scaled_distance * sinf(radar_dots[i].angle));

        uint8_t alpha = 0xFFU - (age * 0xFFU / RADAR_DOT_LIFE_SPAN);
        uint32_t color = (alpha << 24) | 0x0018AB18;

        // da v framebufferju ne ostane zadnja verzija blede pike ampak se cleara tisto piko in oznaci kot invalid
        if (age >= RADAR_DOT_LIFE_SPAN)
        {
            radar_dots[i].valid = 0;
            color = 0x00000000UL;
        }

        UTIL_LCD_FillCircle(x, y, 4, color);
    }
}

void add_new_radar_dot(float_t distance, float_t angle)
{
    if (distance > MAX_DISTANCE_TO_RENDER_DOT || distance < MIN_DISTANCE_TO_RENDER_DOT)
    {
        return;
    }

    if (radar_dots_next_index >= NBR_OF_RADAR_DOTS)
    {
        radar_dots_next_index = 0;
    }

    radar_dots[radar_dots_next_index].angle = angle;
    radar_dots[radar_dots_next_index].distance = distance;
    radar_dots[radar_dots_next_index].timestamp = HAL_GetTick();
    radar_dots[radar_dots_next_index].valid = 1;
    ++radar_dots_next_index;

    buzzer_short_beep_start();
}